# დაწერე პროგრამა, რომელიც შეამოწმებს რიცხვი ლუწია თუ კენტი. თუ რიცხვი იყოფა 2-ზე — დაბეჭდოს "ლუწი", სხვა შემთხვევაში — "კენტი". (გამოიყენეთ % ოპერატორი)

# მომხმარებელს შემოაყვანინეთ რიცხვი და შეამოწმეთ 0-ზე მეტია თუ არა, თუ მეტია დაპრინტეთ 'დადებითია', სხვა შემთხვევაში 'უარყოფითია'

# მომხმარებელს შემოაყვანინეთ რიცხვი, თუ ასაკი არის 18 ან მეტი — დაბეჭდოს "შეგიძლია ხმის მიცემა", სხვა შემთხვევაში — "ჯერ პატარა ხარ".

# მომხმარებელს შემოაყვანინეთ ქულა (0-დან 100-მდე). თუ ქულა არის 50 ან მეტი — დაბეჭდოს "ჩააბარე", სხვა შემთხვევაში — "ვერ ჩააბარე".

# შექმენი ცვლადი password = "1234". მომხმარებელმა შეიყვანოს პაროლი. თუ შეყვანილი პაროლი ემთხვევა "1234" — დაბეჭდოს "სწორია", სხვა შემთხვევაში — "არასწორია".


if int(input("შეიყვანეთ რიცხვი: ")) > 0:
    print("დადებითია")
else:
    print("უარყოფითია")




   
if int(input("შეიყვანეთ ასაკი: ")) >= 18:
        print("შეგიძლია ხმის მიცემა")
else:
        print("ჯერ პატარა ხარ")



if int(input("შეიყვანეთ ქულა: ")) >= 50:
    print("ჩააბარე")
else:
 print("ვერ ჩააბარე")


password = "1234"
if input("შეიყვანეთ პაროლი: ") == password:
    print("სწორია")
else:
    print("არასწორია")